In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.2.5'

In [3]:
pd.Series(data=[1, 2, 3, 4, 5], index=["a", "b", "d", "e", "f"])

a    1
b    2
d    3
e    4
f    5
dtype: int64

In [4]:
dic={"Kawshik": "EEE", "Tanvir": "CSE", "Sayedul": "EEE"}
pd.Series(dic)

Kawshik    EEE
Tanvir     CSE
Sayedul    EEE
dtype: object

In [5]:
age={"Kawshik": 22, "Tanvir": 21, "Sayedul":22}
pd.Series(age, index=['K', "T", "S"])

K   NaN
T   NaN
S   NaN
dtype: float64

In [6]:
lis=[1, 2, 3, 4, 5]
pd.Series(lis)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
import numpy as np

In [8]:
pd.Series(5.0, index=["a", "b", "c", "d", "e"])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [10]:
d={"one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]), 
  "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"])}
pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [11]:
d={"one": pd.Series([1.0, 2.0, 3.0]), 
  "two": pd.Series([1.0, 2.0, 3.0, 4.0])}
pd.DataFrame(d)

   one  two
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  NaN  4.0

In [12]:
d={"one": pd.Series([1.0, 2.0, 3.0], index=["m", "n", "o"]), 
  "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"])}
pd.DataFrame(d)

   one  two
a  NaN  1.0
b  NaN  2.0
c  NaN  3.0
d  NaN  4.0
m  1.0  NaN
n  2.0  NaN
o  3.0  NaN

In [13]:
d = {"one": [1.0, 2.0, 3.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [14]:
s=pd.Series([10, 11, 12, 13, 14, 15])

In [15]:
pd.DataFrame(s, columns=["Number"])

   Number
0      10
1      11
2      12
3      13
4      14
5      15

In [16]:
import numpy as np

In [24]:
array=np.random.randint(1, 20, (4,4))
array

array([[ 9, 11, 11,  5],
       [15, 15,  3, 15],
       [ 3,  6,  2, 17],
       [16, 16, 17,  9]])

In [28]:
df=pd.DataFrame(array)

In [29]:
np.arange(1, 5)

array([1, 2, 3, 4])

In [30]:
type(df)

pandas.core.frame.DataFrame